src/test/performance/lighthouse.yml
# Artillery Load Test Configuration for Lighthouse CI
# Run with: npx artillery run lighthouse.yml

config:
  target: http://localhost:5173
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  http:
    timeout: 30000
    pool: 10
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    cloudwatch:
      namespace: "ContentAutoPilot/LoadTest"

scenarios:
  - name: "Authentication Flow"
    weight: 30
    flow:
      - get:
          url: "/login"
          name: "login-page"
      - post:
          url: "/api/v1/auth/login"
          name: "login-api"
          headers:
            Content-Type: "application/json"
          json:
            email: "demo@agency.com"
            password: "demo123"
          capture:
            - json: "$.data.tokens.accessToken"
              as: "authToken"
            - json: "$.data.user.organizationMemberships[0].organizationId"
              as: "orgId"
      - get:
          url: "/dashboard"
          name: "dashboard-page"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Content Generation"
    weight: 40
    flow:
      - post:
          url: "/api/v1/auth/login"
          name: "login-api"
          json:
            email: "demo@agency.com"
            password: "demo123"
          capture:
            - json: "$.data.tokens.accessToken"
              as: "authToken"
            - json: "$.data.user.organizationMemberships[0].organizationId"
              as: "orgId"
      - get:
          url: "/api/v1/workspaces"
          name: "get-workspaces"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Organization-Context: "{{ orgId }}"
          capture:
            - json: "$.data.workspaces[0]._id"
              as: "workspaceId"
      - post:
          url: "/api/v1/content/generate"
          name: "content-generation"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Organization-Context: "{{ orgId }}"
          json:
            prompt: "Create a social media post about technology trends"
            platform: "linkedin"
            contentType: "post"
            workspaceId: "{{ workspaceId }}"

  - name: "Onboarding Flow"
    weight: 20
    flow:
      - get:
          url: "/api/v1/onboarding/progress"
          name: "onboarding-progress"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Organization-Context: "{{ orgId }}"
      - post:
          url: "/api/v1/onboarding/steps/create_workspace/complete"
          name: "complete-step"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Organization-Context: "{{ orgId }}"
          json:
            metadata:
              timeSpent: 45000
              source: "load_test"

  - name: "Analytics"
    weight: 10
    flow:
      - get:
          url: "/api/v1/analytics/organization"
          name: "org-analytics"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Organization-Context: "{{ orgId }}"
          qs:
            timeframe: "month"
            metrics: "content,engagement"